app/controllers/employees_controller.rb

  def set_employee
    @employee = Employee.find(params["id"])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" IS NULL LIMIT ?  [["LIMIT", 1]]